Repository: caspianchan31/in0
Catalog: in0/Localization/Localizable.xcstrings
Source language: en
Languages: ja, zh_hans, zh_hant

# %@ open · %@ done
source: %1$@ open · %2$@ done
ja: %1$@ 件未完了 · %2$@ 件完了
zh_hant: %1$@ 開啟 · %2$@ 完成

# app.ghostty.notFound.detail
source: Run ./scripts/build-vendor.sh first, then rebuild in0.
ja: 先に ./scripts/build-vendor.sh を実行してから、in0 を再ビルドしてください。
zh_hans: 请先运行 ./scripts/build-vendor.sh，再重新构建 in0。
zh_hant: 請先執行 ./scripts/build-vendor.sh，再重新建置 in0。

# app.ghostty.notFound.title
source: libghostty not initialized
ja: libghostty が初期化されていません
zh_hans: libghostty 未初始化
zh_hant: libghostty 未初始化

# menu.closeOtherTabs
source: Close Other Tabs
ja: ほかのタブを閉じる
zh_hans: 关闭其他标签页
zh_hant: 關閉其他標籤頁

# menu.closeTab
source: Close Tab
ja: タブを閉じる
zh_hans: 关闭标签页
zh_hant: 關閉標籤頁

# menu.closeTabsToRight
source: Close Tabs to the Right
ja: 右側のタブを閉じる
zh_hans: 关闭右侧标签页
zh_hant: 關閉右側標籤頁

# menu.editConfig
source: Edit Config File…
ja: 設定ファイルを編集…
zh_hans: 编辑配置文件…
zh_hant: 編輯設定檔…

# menu.find
source: Find
ja: 検索
zh_hans: 查找
zh_hant: 尋找

# menu.findNext
source: Find Next
ja: 次を検索
zh_hans: 查找下一个
zh_hant: 尋找下一個

# menu.findPrevious
source: Find Previous
ja: 前を検索
zh_hans: 查找上一个
zh_hant: 尋找上一個

# menu.focusDown
source: Focus Down
ja: 下へフォーカス
zh_hans: 焦点下移
zh_hant: 焦點下移

# menu.focusLeft
source: Focus Left
ja: 左へフォーカス
zh_hans: 焦点左移
zh_hant: 焦點左移

# menu.focusRight
source: Focus Right
ja: 右へフォーカス
zh_hans: 焦点右移
zh_hant: 焦點右移

# menu.focusUp
source: Focus Up
ja: 上へフォーカス
zh_hans: 焦点上移
zh_hant: 焦點上移

# menu.newTab
source: New Tab
ja: 新規タブ
zh_hans: 新建标签页
zh_hant: 新增標籤頁

# menu.settings
source: Settings…
ja: 設定…
zh_hans: 设置…
zh_hant: 設定…

# menu.splitDown
source: Split Down
ja: 下に分割
zh_hans: 向下分屏
zh_hant: 向下分割

# menu.splitRight
source: Split Right
ja: 右に分割
zh_hans: 向右分屏
zh_hant: 向右分割

# settings.agents.betaBadge
source: BETA
ja: ベータ

# settings.agents.notificationsFooter
source: Show running / idle / finished status icons next to tabs that run the selected agents.
ja: 選択したエージェントを実行しているタブの横に、実行中 / アイドル / 完了のステータスアイコンを表示します。
zh_hans: 在跑这些 agent 的 tab 旁显示运行 / 闲置 / 完成的状态图标。
zh_hant: 在執行這些 agent 的標籤頁旁顯示執行中 / 閒置 / 完成的狀態圖示。

# settings.agents.notificationsTitle
source: Notifications
ja: 通知
zh_hans: 通知
zh_hant: 通知

# settings.agents.resumeFooter
source: On next launch, auto-run the latest saved resume command to land back in the most recent session. Off by default. Turning a row off also drops any saved session id.
ja: 次回起動時に、保存済みの最新 resume コマンドを自動実行して直近のセッションへ戻ります。既定ではオフです。行をオフにすると保存済みのセッション ID も削除されます。
zh_hans: 下次启动时自动执行最近保存的 resume 命令，回到最近一次会话。默认关闭。关闭某一行同时会清除已保存的会话 id。
zh_hant: 下次啟動時自動執行最近儲存的 resume 命令，回到最近一次工作階段。預設關閉。關閉某一列也會清除已儲存的工作階段 id。

# settings.agents.resumeTitle
source: Resume on Launch
ja: 起動時にセッションを復元
zh_hans: 启动时恢复会话
zh_hant: 啟動時恢復工作階段

# settings.appearance.backgroundBlur
source: Background Blur
ja: 背景ぼかし
zh_hans: 背景模糊
zh_hant: 背景模糊

# settings.appearance.backgroundOpacity
source: Background Opacity
ja: 背景の不透明度
zh_hans: 背景不透明度
zh_hant: 背景不透明度

# settings.appearance.contentOpacity
source: Content Opacity
ja: コンテンツの不透明度
zh_hans: 内容不透明度
zh_hant: 內容不透明度

# settings.appearance.contentShadow
source: Content Shadow
ja: コンテンツの影
zh_hans: 内容阴影
zh_hant: 內容陰影

# settings.appearance.cursorBlink
source: Cursor Blink
ja: カーソル点滅
zh_hans: 光标闪烁
zh_hant: 游標閃爍

# settings.appearance.cursorStyle
source: Cursor Style
ja: カーソルスタイル
zh_hans: 光标样式
zh_hant: 游標樣式

# settings.appearance.followsTerminalBackground
source: Follow ghostty terminal background
ja: ghostty の端末背景に合わせる
zh_hans: 跟随 ghostty 终端背景色
zh_hant: 跟隨 ghostty 終端背景色

# settings.appearance.language
source: Language
ja: 言語
zh_hans: 语言
zh_hant: 語言

# settings.appearance.statusIndicators
source: Show terminal status indicators
ja: 端末ステータスインジケータを表示
zh_hans: 显示终端状态指示器
zh_hant: 顯示終端狀態指示器

# settings.appearance.theme
source: Theme
ja: テーマ
zh_hans: 主题
zh_hant: 主題

# settings.appearance.unfocusedPaneOpacity
source: Unfocused Pane Opacity
ja: 非フォーカスペインの不透明度
zh_hans: 非聚焦窗格不透明度
zh_hant: 未聚焦窗格不透明度

# settings.appearance.windowPaddingX
source: Window Padding X
ja: ウィンドウ余白 X
zh_hans: 窗口内边距 X
zh_hant: 視窗內距 X

# settings.appearance.windowPaddingY
source: Window Padding Y
ja: ウィンドウ余白 Y
zh_hans: 窗口内边距 Y
zh_hant: 視窗內距 Y

# settings.font.custom
source: Custom…
ja: カスタム…
zh_hans: 自定义…
zh_hant: 自訂…

# settings.font.customPlaceholder
source: e.g. JetBrains Mono
ja: 例: JetBrains Mono
zh_hans: 如 JetBrains Mono
zh_hant: 例如 JetBrains Mono

# settings.font.default
source: Default (system monospace)
ja: 既定（システム等幅フォント）
zh_hans: 默认（系统等宽字体）
zh_hant: 預設（系統等寬字體）

# settings.font.family
source: Family
ja: ファミリー
zh_hans: 字体族
zh_hant: 字體族

# settings.font.footer
source: Font overrides are written to the ghostty user config; theme refresh fires after a 200 ms debounce.
ja: フォントの上書きは ghostty のユーザー設定へ書き込まれます。テーマ更新は 200 ms のデバウンス後に反映されます。
zh_hans: 字体设置会写入 ghostty 用户配置；主题会在 200 ms 防抖后刷新。
zh_hant: 字體設定會寫入 ghostty 使用者設定；主題會在 200 ms 防抖後重新整理。

# settings.font.listButton
source: Pick from list
ja: 一覧から選択
zh_hans: 从列表选择
zh_hant: 從列表選擇

# settings.font.size
source: Size
ja: サイズ
zh_hans: 字号
zh_hant: 字號

# settings.font.thicken
source: Thicken text
ja: 文字を太くする
zh_hans: 加粗字重
zh_hant: 加粗文字

# settings.footer.live
source: Changes apply live.
ja: 変更は即時に反映されます。
zh_hans: 修改即时生效。
zh_hant: 變更會即時套用。

# settings.language.system
source: System
ja: システムに合わせる
zh_hans: 跟随系统
zh_hant: 跟隨系統

# settings.quickActions.addCustomButton
source: Add custom action
ja: カスタムアクションを追加
zh_hans: 新增自定义快捷操作
zh_hant: 新增自訂快捷操作

# settings.quickActions.customCommandPlaceholder
source: Command
ja: コマンド
zh_hans: 命令
zh_hant: 命令

# settings.quickActions.customNamePlaceholder
source: Name
ja: 名前
zh_hans: 名称
zh_hant: 名稱

# settings.quickActions.deleteCustom.tooltip
source: Delete this custom action
ja: このカスタムアクションを削除
zh_hans: 删除这个自定义快捷操作
zh_hant: 刪除此自訂快捷操作

# settings.quickActions.heading
source: Enabled & Order
ja: 有効化と順序
zh_hans: 启用与排序
zh_hant: 啟用與排序

# settings.quickActions.headingFooter
source: Enabled buttons appear in the top-right corner of the window. Drag to reorder.
ja: 有効なボタンはウィンドウ右上に表示されます。ドラッグして並べ替えできます。
zh_hans: 启用的按钮会按下方顺序出现在窗口右上角，可拖拽排序。
zh_hant: 啟用的按鈕會出現在視窗右上角。可拖曳重新排序。

# settings.reset.alertTitle
source: Reset this section to defaults?
ja: このセクションを既定値に戻しますか？
zh_hans: 把本分区重置为默认值？
zh_hant: 將此區段重設為預設值？

# settings.reset.button
source: Reset
ja: リセット
zh_hans: 重置
zh_hant: 重設

# settings.reset.cancel
source: Cancel
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

# settings.reset.message
source: Removes this section's overrides from the in0 config file. Existing tabs are unaffected; new tabs use the ghostty defaults until you change them again.
ja: このセクションの上書きを in0 設定ファイルから削除します。既存のタブには影響しません。再度変更するまで、新しいタブには ghostty の既定値が使われます。
zh_hans: 从 in0 配置文件中移除本分区的所有自定义项。已打开的标签页不受影响；新标签将使用 ghostty 默认设置，直到你再次更改。
zh_hant: 從 in0 設定檔移除此區段的覆寫。現有標籤頁不受影響；新標籤頁會使用 ghostty 預設值，直到你再次變更。

# settings.reset.rowLabel
source: Restore Defaults
ja: 既定値に戻す
zh_hans: 恢复默认
zh_hant: 恢復預設值

# settings.section.agents
source: Agents
ja: エージェント

# settings.section.appearance
source: Appearance
ja: 外観
zh_hans: 外观
zh_hant: 外觀

# settings.section.font
source: Font
ja: フォント
zh_hans: 字体
zh_hant: 字體

# settings.section.plugins
source: Plugins
ja: プラグイン
zh_hans: 插件
zh_hant: 外掛

# settings.section.quickActions
source: Quick Actions
ja: クイックアクション
zh_hans: 快捷操作
zh_hant: 快捷操作

# settings.section.shell
source: Shell
ja: シェル

# settings.section.terminal
source: Terminal
ja: 端末
zh_hans: 终端
zh_hant: 終端

# settings.section.update
source: Update
ja: アップデート
zh_hans: 更新
zh_hant: 更新

# settings.shell.customCommand
source: Command
ja: コマンド
zh_hans: 命令
zh_hant: 命令

# settings.shell.features
source: Integration Features
ja: 統合機能
zh_hans: 集成特性
zh_hant: 整合功能

# settings.shell.footer
source: Shell integration controls ghostty's shell hooks. Leave custom command blank to use the system default. Git viewer auto-runs in the workspace's dedicated git tab (Command-Shift-G).
ja: シェル統合は ghostty の shell hooks を制御します。カスタムコマンドを空にするとシステム既定のシェルを使用します。Git ビューアはワークスペース専用の Git タブ（Command-Shift-G）で自動実行されます。
zh_hans: Shell 集成控制 ghostty 的 shell hooks。自定义命令留空则使用系统默认 shell。Git 查看器会在工作区专用 Git 标签页中自动运行（Command-Shift-G）。
zh_hant: Shell 整合控制 ghostty 的 shell hooks。自訂命令留空則使用系統預設 shell。Git 檢視器會在工作區專用 Git 標籤頁中自動執行（Command-Shift-G）。

# settings.shell.gitViewer
source: Git Viewer
ja: Git ビューア
zh_hans: Git 查看器
zh_hant: Git 檢視器

# settings.shell.gitViewer.placeholder
source: e.g. gitui / lazygit / gh dash
ja: 例: gitui / lazygit / gh dash
zh_hans: 例如 gitui / lazygit / gh dash
zh_hant: 例如 gitui / lazygit / gh dash

# settings.shell.integration
source: Shell Integration
ja: シェル統合
zh_hans: Shell 集成
zh_hant: Shell 整合

# settings.terminal.confirmClose
source: Confirm Close
ja: 閉じる前に確認
zh_hans: 关闭确认
zh_hant: 關閉確認

# settings.terminal.copyOnSelect
source: Copy On Select
ja: 選択時にコピー
zh_hans: 选中即复制
zh_hant: 選取即複製

# settings.terminal.footer
source: Terminal behavior writes to the in0 override config. Some ghostty keys affect live surfaces immediately; shell-launch keys apply to new panes.
ja: 端末の動作は in0 の上書き設定へ書き込まれます。一部の ghostty キーは既存の端末へ即時反映されます。シェル起動キーは新しいペインに適用されます。
zh_hans: 终端行为会写入 in0 覆盖配置。部分 ghostty 设置会立即影响现有终端；shell 启动设置会应用到新窗格。
zh_hant: 終端行為會寫入 in0 覆寫設定。部分 ghostty 設定會立即影響現有終端；shell 啟動設定會套用到新窗格。

# settings.terminal.hideMouseWhileTyping
source: Hide Mouse While Typing
ja: 入力中にマウスを隠す
zh_hans: 键入时隐藏鼠标
zh_hant: 輸入時隱藏滑鼠

# settings.terminal.scrollbackLimit
source: Scrollback Limit
ja: スクロールバック上限
zh_hans: 回滚缓冲大小
zh_hant: 回捲緩衝大小

# settings.theme.dark
source: Dark theme
ja: ダークテーマ
zh_hans: 深色主题
zh_hant: 深色主題

# settings.theme.followSystem
source: Follow system
ja: システムに合わせる
zh_hans: 跟随系统
zh_hant: 跟隨系統

# settings.theme.inherit
source: Inherit from ghostty
ja: ghostty から継承
zh_hans: 继承自 ghostty
zh_hant: 繼承自 ghostty

# settings.theme.light
source: Light theme
ja: ライトテーマ
zh_hans: 浅色主题
zh_hant: 淺色主題

# settings.theme.name
source: Name
ja: 名前
zh_hans: 名称
zh_hant: 名稱

# settings.theme.searchPlaceholder
source: Search themes…
ja: テーマを検索…
zh_hans: 搜索主题…
zh_hant: 搜尋主題…

# settings.theme.single
source: Single
ja: 単一
zh_hans: 单一
zh_hant: 單一

# settings.update.action
source: Action
ja: 操作
zh_hans: 操作
zh_hant: 操作

# settings.update.checkForUpdates
source: Check for Updates
ja: アップデートを確認
zh_hans: 检查更新
zh_hant: 檢查更新

# settings.update.checking
source: Checking…
ja: 確認中…
zh_hans: 检查中…
zh_hant: 檢查中…

# settings.update.currentVersion
source: Current Version
ja: 現在のバージョン
zh_hans: 当前版本
zh_hant: 目前版本

# settings.update.dismiss
source: Dismiss
ja: 閉じる
zh_hans: 稍后再说
zh_hant: 稍後再說

# settings.update.downloading
source: Downloading
ja: ダウンロード中
zh_hans: 下载中
zh_hant: 下載中

# settings.update.downloadInstall
source: Download & Install
ja: ダウンロードしてインストール
zh_hans: 下载并安装
zh_hant: 下載並安裝

# settings.update.installing
source: Installing…
ja: インストール中…
zh_hans: 安装中…
zh_hant: 安裝中…

# settings.update.retry
source: Retry
ja: 再試行
zh_hans: 重试
zh_hant: 重試

# settings.update.skipThisVersion
source: Skip This Version
ja: このバージョンをスキップ
zh_hans: 跳过此版本
zh_hant: 略過此版本

# settings.update.status
source: Status
ja: ステータス
zh_hans: 状态
zh_hant: 狀態

# settings.update.unavailable
source: Updates are disabled in this build.
ja: このビルドではアップデートが無効です。
zh_hans: 当前构建未启用更新。
zh_hant: 此建置未啟用更新。

# settings.update.upToDate
source: You're on the latest version.
ja: 最新バージョンです。
zh_hans: 已是最新版本。
zh_hant: 你已使用最新版本。

# sidebar.row.commandPanel.editTitle
source: Edit Default Command…
ja: 既定コマンドを編集…
zh_hans: 编辑默认命令…
zh_hant: 編輯預設命令…

# sidebar.row.delete
source: Delete…
ja: 削除…
zh_hans: 删除…
zh_hant: 刪除…

# sidebar.row.rename
source: Rename
ja: 名前を変更
zh_hans: 重命名
zh_hant: 重新命名
